# Data Wrangling

In [2]:
import pandas as pd

## Read CSV Files

In [3]:
csv_data = pd.read_csv('data.csv')

In [4]:
csv_data.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

## Read Excel Files

In [6]:
excel_data = pd.read_excel('data.xls')

In [7]:
excel_data.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

# Read Json Files

In [8]:
json_data = pd.read_json("https://www.w3schools.com/python/pandas/data.js")

In [9]:
json_data.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

# Read DataBase file

In [13]:
from sqlalchemy import create_engine
database_connection= create_engine('sqlite:///data.db')